package hw_5;

import java.util.ArrayList;
import java.util.List;

public class Main {
    public static void main(String[] args) {

//
//        створити ArrayList зі словами на 15-20 елементів.
//                - відсортувати його за алфавітом .
//                *-- відфільтрувати слова довжиною менше 4 символів
//
//                - Створити масив з 20 числами.
//                - за допомогою способу sorted відсортувати масив.
//                -- за допомогою filter отримати числа кратні 3
//                -- за допомогою filter отримати числа кратні 10
//                -- перебрати (проітерувати) масив за допомогою foreach()
//                -- перебрати масив за допомогою map() і отримати новий масив, в якому всі значення будуть у 3 рази більші
//

        List characters2 = new ArrayList<>();
        characters2.add("Lacus");
        characters2.add("Adelaide");
        characters2.add("Luise");
        characters2.add("Aqzert");
        characters2.add("Ray");
        characters2.add("Dalia");
        characters2.add("Doloria");
        characters2.add("Ghran");
        characters2.add("Claude");
        characters2.add("Naygrim");
        characters2.add("Lutikoria");
        characters.add("Liam");
        characters2.add("Ines");
        characters2.add("Vi");
        characters2.add("Elsa");

        characters2.stream()
                .sorted(String::compareToIgnoreCase)
                .forEach(System.out::println);











//
//        Це абстрактне завдання, в якого ыснуэ 100500 способів вирішення, тому його сприймате просто як список можливих варіацій бізнес процесів.
//                Вважайте, що тут нема правильної відповіді
//
//        Створити клас автомобіля з полями:
//        Марка автомобля, потужність двигуна, власник, ціна, рік випуску.
//                Власник автомобіля теж має бути обєкт, у якого є поля
//        Імя, вік, стаж водіння.
//                Створити не менше 7 та не більше 20 машинок.
//                Зробили половині автопарку ремонт мотору, що збільшить потужність автомобілів на 10% (переприсвоєння змінної потужності).
//        Після того в масиві цих автівок зробити перевірку досвіду ВСІХ наших водіїв.
//        Якщо досвід водія менший за 5 років, але його вік більший за 25, то необідно відправити його на курси підвищення кваліфікації, що збільшить йому досвід на 1 рік.
//                Також спробуйте порахувати суму, яку потрібно потратити для покупки всіх цих авто
//        Все через stream API
//
    }
}
